--Создание таблиц
--Типы продуктов
CREATE TABLE types (
  id serial PRIMARY KEY,
  type VARCHAR(64) UNIQUE
);
--Продукты
CREATE TABLE products (
  id serial PRIMARY KEY,
  name_product VARCHAR(255),
  type_id int REFERENCES types(id),
  expired_date TIMESTAMP(6) CHECK (expired_date > CURRENT_DATE),
  price numeric check (price > 0)
);
--Количество продуктов
CREATE TABLE products_amount(
    id serial PRIMARY KEY,
    product int REFERENCES products(id),
    amount INT CHECK (amount > 0)
);

--Заполнение таблиц

INSERT INTO types(type)
VALUES
('СЫР'),('МОЛОКО'),('РЫБА'),('МЯСОПРОДУКТЫ'),('ОВОЩИ'),
('ФРУКТЫ'),('КОНДИТЕРСКИЕ ИЗДЕЛИЯ');

INSERT INTO products(name_product, type_id, expired_date, price)
VALUES
('сырок ванильный', 7, '2019-01-12', 23.50),
('сырок шоколадынй', 7, '2018-05-15', 25.50),
('сырок клубничный', 7, '2018-05-14', 24.50),
('сырок творожный', 7, '2019-01-22', 33.50),
('сырок мороженный', 7, '2018-06-17', 13.50),
('молоко 1 л', 2, '2019-04-12', 53.00),
('молоко 2 л', 2, '2018-05-14', 60.00),
('молоко 0,5 л', 2, '2018-07-22', 48.50),
('карась', 3, '2018-06-12', 63.70),
('бельдюга', 3, '2018-10-12', 76.80),
('мороженое пломбир 500 гр', 7, '2019-03-22', 13.00),
('мороженое ванильное', 7, '2018-06-12', 15.00),
('мороженое шоколадное', 7, '2019-05-22', 18.50),
('мясо замороженное', 4, '2018-05-12', 76.90),
('баранина', 4, '2019-01-12', 83.00),
('картошка', 5, '2018-08-12', 41.20),
('морковь', 5, '2018-08-16', 33.10),
('бананы', 6, '2018-07-12', 62.00),
('яблоки', 6, '2018-07-12', 70.00),
('Сыр голландский', 1, '2018-07-22', 270.00),
('Сыр белорусский', 1, '2018-09-17', 370.00),
('Сыр почехонский', 1, '2019-02-12', 470.50),
('молоко замороженное', 2, '2018-06-25', 50.00);


INSERT INTO products_amount (product, amount)
VALUES (1,12),(2,32),(3,22),(4,52),(5,62),(6,80),(7,25),(8,2),
(9,43),(10,112),(11,103),(12,1),(13,65),(14,52),(15,15),(16,8),
(17,2),(18,9),(19,19),(20,10),(21,7),(22,49),(23,15);